The Goal of this Project is to connect to a database with a programming language. I will be using Python. Using both Python and PostreSQL I will do some analysis on the cooking dataset pulled from questions and users from the cooking stackexchange  website.

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Look at private.txt to find out how to connect to database
engine = create_engine('postgresql://cslab:TacoSh%40ck@localhost:5432/cooking')

## Problem 1: Find the highest scoring question with a unique tag.

In [14]:
pd.read_sql_query(
    '''
    select distinct tags, score from posts where (char_length(tags) - char_length(replace(tags,'<',''))) = 1 order by score desc limit 5
    '''
    ,engine)

         tags  score
0   <chicken>    129
1      <meat>     75
2      <salt>     75
3  <shallots>     67
4      <eggs>     65

## Problem 2: Pick a holiday and try to find the highest scoring answers relevant to that holiday.

I pick Christmas to find the highest scoring answer using Day of the Year in postresql (DOY) as 359

In [20]:
pd.read_sql_query(
    '''
        select id,extract(DOY from creationdate),score,body from posts where extract(DOY from creationdate) = 359 order by score desc limit 5
    '''
,engine)

      id  date_part  score                                               body
0  86684      359.0     18  <p>Some foods dissolve aluminum foil. From exp...
1  29428      359.0     16  <p>If you're drinking the espresso shot on its...
2  10495      359.0     15  <p>It IS the roast that is the difference.  Th...
3  51953      359.0     13  <p>Good news: I finally got 'round to cleaning...
4  10494      359.0     13  <p>I was reminded of this curiosity just momen...

## Problem 3: Build a graphviz dot file with the relationships between the top 200 users where users are connected if they answered a question another user asked.

In [28]:
topusers = pd.read_sql_query(
    '''
        select id,displayname,reputation from users order by reputation desc limit 200
    '''
,engine)

In [76]:
topusersids = list(topusers['id'])

# Convert python list to a string in postgres list format
sui = str(topusersids)
sui = sui.replace('[','(')
sui = sui.replace(']',')')

# Select all of the questions asked 
tuq = pd.read_sql_query(
    '''
        select id,owneruserid from posts where owneruserid in {} and posttypeid = 1
    '''.format(sui)
,engine)

tua = pd.read_sql_query(
    '''
        select id,owneruserid,parentid from posts where owneruserid in {} and posttypeid = 2
    '''.format(sui)
,engine)

# topusersconn = pd.read_sql_query(
#     '''
#         select (Q.id,Q.ownderuserid)
#             (select id,owneruserid from posts where owneruserid in {} and posttypeid = 1)
#             as Q
#                 (select id,owneruserid,parentid from posts where owneruserid in {} and posttypeid = 2)
#                 as A
#     '''.format(sui)
# ,engine)

In [81]:
qid = list(topusersquestions['id'])

In [96]:
tuq[0:5]

      id  owneruserid
0  11984          611
1  11997         4777
2  12048         4580
3  12055         1601
4  12084         1672

In [99]:
t200a = tua[tua['parentid'].isin(qid)]
t200a[0:5]

       id  owneruserid  parentid
2   11985         4504     11984
7   12000         1393     11997
24  12051         1816     12048
26  12056           67     12055
33  12088         4504     12055

In [104]:
t200aq = t200a.merge(tuq,right_on='id',left_on='parentid')
t200aq[0:5]

    id_x  owneruserid_x  parentid   id_y  owneruserid_y
0  11985           4504     11984  11984            611
1  12000           1393     11997  11997           4777
2  12051           1816     12048  12048           4580
3  28813           6638     12048  12048           4580
4  28863          14539     12048  12048           4580

In [165]:
# Nodes will be ownderuserid_y (questions), edges will be the owneruserid_x (the answers) on the same row
from graphviz import Digraph # Make sure graphviz is installed in your system PATH

quid = list(t200aq['owneruserid_y'])
auid = list(t200aq['owneruserid_x'])

t = Digraph('Top 200 Interactions', filename='top200Interactions.gv', engine='neato')

t.attr('node',shape='box')
for i in range(len(quid)):
    if quid[i] != auid[i]: # Remove all of the people who answered their own question
        t.node(str(quid[i]))

t.attr('node',shape='circle')
for i in range(len(auid)):
    if quid[i] != auid[i]: 
        t.edge(str(quid[i]),str(auid[i]))

t.view()

'top200Interactions.gv.pdf'

This graph looks extremely packed because there are over 4000 separate things to graph! There are a lot of intereactions between the top 200 users. Lets only select the top 5 user interactions and see if the graph looks better. First we will need to put the above code into a function so that we can reuse it easier.

In [162]:
def topXInteractions(topX,filename):
    topusers = pd.read_sql_query(
    '''
        select id,displayname,reputation from users order by reputation desc limit {}
    '''.format(topX)
    ,engine)
    
    
    topusersids = list(topusers['id'])

    # Convert python list to a string in postgres list format
    sui = str(topusersids)
    sui = sui.replace('[','(')
    sui = sui.replace(']',')')

    # Select all of the questions asked 
    tuq = pd.read_sql_query(
        '''
            select id,owneruserid from posts where owneruserid in {} and posttypeid = 1
        '''.format(sui)
    ,engine)

    tua = pd.read_sql_query(
        '''
            select id,owneruserid,parentid from posts where owneruserid in {} and posttypeid = 2
        '''.format(sui)
    ,engine)
    
    qid = list(topusersquestions['id'])
    
    t200a = tua[tua['parentid'].isin(qid)]
    
    t200aq = t200a.merge(tuq,right_on='id',left_on='parentid')
    
    quid = list(t200aq['owneruserid_y'])
    auid = list(t200aq['owneruserid_x'])

    # Graph the interactions
    
    t = Digraph('Top 200 Interactions', filename=filename, engine='neato')
    t.attr(size='6,6')
    t.node_attr.update(color='lightblue2', style='filled')
    
    
    t.attr('node',shape='box',fixedsize='true')
    for i in range(len(quid)):
        if quid[i] != auid[i]:
            t.node(str(quid[i]))

    t.attr('node',shape='circle')
    for i in range(len(auid)):
        if quid[i] != auid[i]:
            t.edge(str(quid[i]),str(auid[i]))

    t.view()

In [163]:
topXInteractions(5,'top5Interactions.gv')

It is still a little crowded but looks much better than the top 200!